       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY "Hello, World!".
           STOP RUN.
        